{
  "blogs": [
    {
      "title": "Global smartphone shipments expected to rebound 11% this year",
      "author": "visshnnu tejaa",
      "body": "Like countless other industries, mobile phone sales got hit hard in 2020. The industry hit a 10.5% decline for the year, as Covid-19 first decimated the supply and later consumer demand for devices. It was the latest in a rough couple of years for manufacturers, but 2020 hit significantly harder than most.\n\nNew numbers from Gartner point to a rebound to pre-2020 levels. The firm is forecasting 1.5 billion devices shipped globally for 2021, amounting to an 11.4% increase across the board. We certainly saw the beginnings of that rebound arrive in Q4 for last year, as declines continued to slow, thanks in no small part to a record quarter for iPhone sales.\n\nThat points to the beginnings of a so-called “supercycle” for Apple, which hits a sort of perfect storm. The last few years have seen consumers slow down upgrades, as device prices increased, features were generally less compelling and their existing devices were perfectly fine so as not to warrant a standard two to three year upgrade pattern.\n\nAnalysts pointed to 5G a clear conduit for righting slipping sales numbers early last year, but a global pandemic very much threw a wrench in all of that. If anything, however, the iPhone’s Covid-19 related delay actually contributed to a stellar quarter for the company, both in time for holiday sales and the arrival of multiple vaccines that pointed to some potential return to normalcy.\n\nThe long awaited 5G bump will continue in 2021, according to the new numbers, coupled with a quick push to offer next-gen wireless at an accessible price.\n\n“The growing availability of 5G networks coupled with a higher variety of 5G smartphones starting at $200 will steer demand in mature markets and China,” the firm notes. “Demand in emerging countries will be driven by buyers looking for a smartphone with better specifications and a 5G connectivity as an optional feature. Gartner forecasts sales of 5G smartphones will total 539 million units worldwide in 2021, which will represent 35% of total smartphone sales in that year.”",
      "id": 1
    },
    {
      "title": "Budget 2021 Highlights: FM Nirmala Sitharaman’s get well Budget",
      "author": "visshnnu tejaa",
      "body": "Finance Minister Nirmala Sitharaman has presented the Union Budget 2021-22 in Parliament. In significant changes to the taxation process, Sitharaman announced the scrapping of income tax for senior citizens under certain conditions, new rules for removal of double taxation for NRIs, and a reduction in the time period of tax assessments among other measures. Startups will get an extension in their tax holiday for an additional year.",
      "id": 2
    }
  ]
}